{
    "car accident": "I have been involved in a car accident. Please send help to my location.",
    "fire": "There is a fire in my vicinity. I need assistance immediately.",
    "heart attack": "I think I am having a heart attack. Please send an ambulance.",
    "burglary": "I believe there is a burglary in progress at my location. Please send police.",
    "drowning": "Someone is drowning nearby. Emergency assistance is needed.",
    "plague": "There is a suspected outbreak of a contagious disease in our area. Medical help is required.",
    "terrorism": "I suspect a terrorist activity in my vicinity. Urgent police intervention is needed.",
    "violence": "I am in danger due to violent behavior. Please send help immediately.",
    "poison": "I or someone else has ingested poison. Immediate medical attention is needed.",
    "death": "There is a deceased person at my location. Please send authorities.",
    "choking": "Someone is choking nearby. Please send medical help.",
    "earthquake": "We are experiencing an earthquake. Send assistance.",
    "flood": "There is flooding in my area. Emergency response required.",
    "gas leak": "I smell gas and suspect a leak. Urgent assistance is needed.",
    "kidnapping": "I am being kidnapped. Send help immediately.",
    "shooting": "There is a shooting incident in progress. Send police quickly.",
    "stabbing": "Someone has been stabbed. Medical help needed urgently.",
    "suicide": "I or someone else is contemplating suicide. Immediate intervention required.",
    "accident": "I have been involved in an accident. Send emergency services to my location.",
    "injury": "I or someone else is injured and needs medical attention.",
    "fall": "I or someone else has fallen and needs medical assistance.",
    "emergency": "There is an emergency situation. Please send help.",
    "assault": "I am being assaulted. Send police immediately.",
    "medical emergency": "This is a medical emergency. Please dispatch an ambulance.",
    "mental health crisis": "I am experiencing a mental health crisis. Please send assistance."
}
